import numpy as np

# Даны значения величины заработной платы заемщиков банка (zp) и значения их поведенческого кредитного скоринга
# (ks): zp = [35, 45, 190, 200, 40, 70, 54, 150, 120, 110], ks = [401, 574, 874, 919, 459, 739, 653, 902, 746, 832].
# Используя математические операции, посчитать коэффициенты линейной регрессии, приняв за X заработную плату
# (то есть, zp - признак), а за y - значения скорингового балла (то есть, ks - целевая переменная).
# Произвести расчет как с использованием intercept, так и без.


# с использованием intercept
X = np.array([35, 45, 190, 200, 40, 70, 54, 150, 120, 110])
y = np.array([401, 574, 874, 919, 459, 739, 653, 902, 746, 832])

b = (np.mean(X*y) - np.mean(X)*np.mean(y)) / (np.mean(X**2) - np.mean(X)**2)
# beta равен 2.6205
a = np.mean(y) - b*np.mean(X)
# предиктор 444.17

y_hat = a + b*X
# Ответ [535.89621821 562.10160703 942.07974498 968.2851338  548.99891262 627.61507909 585.68645697
# 837.25818968 758.64202321 732.43663439]

# без использования intercept
X = X.reshape(len(X), 1)
y = y.reshape(len(y), 1)
B = np.dot(np.linalg.inv(np.dot(X.T,X)), X.T@y)
# коэф B равен 5.88982042
y_hat = 0 + 5.88982042*X
# Ответ
# [[ 206.1437147 ]
#  [ 265.0419189 ]
#  [1119.0658798 ]
#  [1177.964084  ]
#  [ 235.5928168 ]
#  [ 412.2874294 ]
#  [ 318.05030268]
#  [ 883.473063  ]
#  [ 706.7784504 ]
#  [ 647.8802462 ]]
